src/logs/api/test-api-prediction-markets-20250801-134914.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-prediction-markets.ts
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 90 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m01.0s/1m0s

running (0m02.0s), 20/20 VUs, 168 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m02.0s/1m0s

running (0m03.0s), 20/20 VUs, 242 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m03.0s/1m0s

running (0m04.0s), 20/20 VUs, 318 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m04.0s/1m0s

running (0m05.0s), 20/20 VUs, 401 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m05.0s/1m0s

running (0m06.0s), 20/20 VUs, 482 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m06.0s/1m0s

running (0m07.0s), 20/20 VUs, 557 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m07.0s/1m0s

running (0m08.0s), 20/20 VUs, 629 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m08.0s/1m0s

running (0m09.0s), 20/20 VUs, 707 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m09.0s/1m0s

running (0m10.0s), 20/20 VUs, 785 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m10.0s/1m0s

running (0m11.0s), 20/20 VUs, 865 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m11.0s/1m0s

running (0m12.0s), 20/20 VUs, 935 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m12.0s/1m0s

running (0m13.0s), 20/20 VUs, 1006 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m13.0s/1m0s

running (0m14.0s), 20/20 VUs, 1084 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m14.0s/1m0s

running (0m15.0s), 20/20 VUs, 1158 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m15.0s/1m0s

running (0m16.0s), 20/20 VUs, 1240 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m16.0s/1m0s

running (0m17.0s), 20/20 VUs, 1314 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m17.0s/1m0s

running (0m18.0s), 20/20 VUs, 1390 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m18.0s/1m0s

running (0m19.0s), 20/20 VUs, 1464 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m19.0s/1m0s

running (0m20.0s), 20/20 VUs, 1547 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m20.0s/1m0s

running (0m21.0s), 20/20 VUs, 1627 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m21.0s/1m0s

running (0m22.0s), 20/20 VUs, 1706 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m22.0s/1m0s

running (0m23.0s), 20/20 VUs, 1791 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m23.0s/1m0s

running (0m24.0s), 20/20 VUs, 1869 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m24.0s/1m0s

running (0m25.0s), 20/20 VUs, 1948 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m25.0s/1m0s

running (0m26.0s), 20/20 VUs, 2032 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m26.0s/1m0s

running (0m27.0s), 20/20 VUs, 2112 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m27.0s/1m0s

running (0m28.0s), 20/20 VUs, 2194 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m28.0s/1m0s

running (0m29.0s), 20/20 VUs, 2272 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m29.0s/1m0s

running (0m30.0s), 20/20 VUs, 2352 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  0m30.0s/1m0s

running (0m31.0s), 20/20 VUs, 2438 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  0m31.0s/1m0s

running (0m32.0s), 20/20 VUs, 2517 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  0m32.0s/1m0s

running (0m33.0s), 20/20 VUs, 2598 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  0m33.0s/1m0s

running (0m34.0s), 20/20 VUs, 2691 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  0m34.0s/1m0s

running (0m35.0s), 20/20 VUs, 2755 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  0m35.0s/1m0s

running (0m36.0s), 20/20 VUs, 2843 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  0m36.0s/1m0s

running (0m37.0s), 20/20 VUs, 2957 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  0m37.0s/1m0s

running (0m38.0s), 20/20 VUs, 3034 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  0m38.0s/1m0s

running (0m39.0s), 20/20 VUs, 3122 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  0m39.0s/1m0s

running (0m40.0s), 20/20 VUs, 3201 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  0m40.0s/1m0s

running (0m41.0s), 20/20 VUs, 3244 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  0m41.0s/1m0s

running (0m42.0s), 20/20 VUs, 3245 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  0m42.0s/1m0s

running (0m43.0s), 20/20 VUs, 3259 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  0m43.0s/1m0s

running (0m44.0s), 20/20 VUs, 3348 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  0m44.0s/1m0s

running (0m45.0s), 20/20 VUs, 3451 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  0m45.0s/1m0s

running (0m46.0s), 20/20 VUs, 3528 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  0m46.0s/1m0s

running (0m47.0s), 20/20 VUs, 3603 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  0m47.0s/1m0s

running (0m48.0s), 20/20 VUs, 3682 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  0m48.0s/1m0s

running (0m49.0s), 20/20 VUs, 3757 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  0m49.0s/1m0s

running (0m50.0s), 20/20 VUs, 3831 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  0m50.0s/1m0s

running (0m51.0s), 20/20 VUs, 3910 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  0m51.0s/1m0s

running (0m52.0s), 20/20 VUs, 3993 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  0m52.0s/1m0s

running (0m53.0s), 20/20 VUs, 4076 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  0m53.0s/1m0s

running (0m54.0s), 20/20 VUs, 4152 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  0m54.0s/1m0s

running (0m55.0s), 20/20 VUs, 4226 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  0m55.0s/1m0s

running (0m56.0s), 20/20 VUs, 4302 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  0m56.0s/1m0s

running (0m57.0s), 20/20 VUs, 4388 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  0m57.0s/1m0s

running (0m58.0s), 20/20 VUs, 4469 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  0m58.0s/1m0s

running (0m59.0s), 20/20 VUs, 4550 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  0m59.0s/1m0s

running (1m00.0s), 20/20 VUs, 4633 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    checks_total.......................: 4653    77.227864/s
    checks_succeeded...................: 100.00% 4653 out of 4653
    checks_failed......................: 0.00%   0 out of 4653

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=256.7ms  min=14.21ms med=223.27ms max=5.11s p(90)=392.81ms p(95)=435.77ms
      { expected_response:true }............................................: avg=256.7ms  min=14.21ms med=223.27ms max=5.11s p(90)=392.81ms p(95)=435.77ms
    http_req_failed.........................................................: 0.00%  0 out of 4653
    http_reqs...............................................................: 4653   77.227864/s

    EXECUTION
    iteration_duration......................................................: avg=258.46ms min=14.21ms med=225.13ms max=5.11s p(90)=394.35ms p(95)=437.94ms
    iterations..............................................................: 4653   77.227864/s
    vus.....................................................................: 20     min=20        max=20
    vus_max.................................................................: 20     min=20        max=20

    NETWORK
    data_received...........................................................: 130 MB 2.1 MB/s
    data_sent...............................................................: 613 kB 10 kB/s



running (1m00.3s), 00/20 VUs, 4653 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  1m0s