src/logs/api/test-api-prediction-markets-20250801-135036.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-prediction-markets.ts
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 1000 iterations shared among 20 VUs (maxDuration: 1m0s, gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 23 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m01.0s/1m0s  0023/1000 shared iters

running (0m02.0s), 20/20 VUs, 94 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m02.0s/1m0s  0094/1000 shared iters

running (0m03.0s), 20/20 VUs, 169 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m03.0s/1m0s  0169/1000 shared iters

running (0m04.0s), 20/20 VUs, 248 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m04.0s/1m0s  0248/1000 shared iters

running (0m05.0s), 20/20 VUs, 326 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m05.0s/1m0s  0326/1000 shared iters

running (0m06.0s), 20/20 VUs, 401 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m06.0s/1m0s  0401/1000 shared iters

running (0m07.0s), 20/20 VUs, 478 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m07.0s/1m0s  0478/1000 shared iters

running (0m08.0s), 20/20 VUs, 553 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  0m08.0s/1m0s  0553/1000 shared iters

running (0m09.0s), 20/20 VUs, 631 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  0m09.0s/1m0s  0631/1000 shared iters

running (0m10.0s), 20/20 VUs, 709 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  0m10.0s/1m0s  0709/1000 shared iters

running (0m11.0s), 20/20 VUs, 786 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  0m11.0s/1m0s  0786/1000 shared iters

running (0m12.0s), 20/20 VUs, 861 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  0m12.0s/1m0s  0861/1000 shared iters

running (0m13.0s), 20/20 VUs, 940 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  0m13.0s/1m0s  0940/1000 shared iters


  █ TOTAL RESULTS 

    checks_total.......................: 1000    72.825943/s
    checks_succeeded...................: 100.00% 1000 out of 1000
    checks_failed......................: 0.00%   0 out of 1000

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=268.96ms min=14.59ms med=271.54ms max=1.21s p(90)=383.38ms p(95)=428.58ms
      { expected_response:true }............................................: avg=268.96ms min=14.59ms med=271.54ms max=1.21s p(90)=383.38ms p(95)=428.58ms
    http_req_failed.........................................................: 0.00%  0 out of 1000
    http_reqs...............................................................: 1000   72.825943/s

    EXECUTION
    iteration_duration......................................................: avg=272.52ms min=15.11ms med=272.08ms max=1.21s p(90)=388.05ms p(95)=436.13ms
    iterations..............................................................: 1000   72.825943/s
    vus.....................................................................: 20     min=20        max=20
    vus_max.................................................................: 20     min=20        max=20

    NETWORK
    data_received...........................................................: 28 MB  2.0 MB/s
    data_sent...............................................................: 134 kB 9.8 kB/s



running (0m13.7s), 00/20 VUs, 1000 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  0m13.7s/1m0s  1000/1000 shared iters