src/logs/api/test-api-prediction-markets-by-market-address-20250731-142808.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-prediction-markets-by-market-address.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 252 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 513 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 780 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 1028 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.1s), 10/10 VUs, 1302 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  05.1s/10s

running (06.0s), 10/10 VUs, 1556 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 1825 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 2081 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 2327 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 2583 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......................: 2593    258.838669/s
    checks_succeeded...................: 100.00% 2593 out of 2593
    checks_failed......................: 0.00%   0 out of 2593

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=35.85ms min=6.99ms med=20.45ms max=114.35ms p(90)=75.93ms p(95)=83.29ms
      { expected_response:true }............................................: avg=35.85ms min=6.99ms med=20.45ms max=114.35ms p(90)=75.93ms p(95)=83.29ms
    http_req_failed.........................................................: 0.00%  0 out of 2593
    http_reqs...............................................................: 2593   258.838669/s

    EXECUTION
    iteration_duration......................................................: avg=38.57ms min=7.23ms med=22.32ms max=181.54ms p(90)=77.42ms p(95)=86.3ms 
    iterations..............................................................: 2593   258.838669/s
    vus.....................................................................: 10     min=10        max=10
    vus_max.................................................................: 10     min=10        max=10

    NETWORK
    data_received...........................................................: 9.6 MB 959 kB/s
    data_sent...............................................................: 501 kB 50 kB/s



running (10.0s), 00/10 VUs, 2593 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s